Тест_ЗУП_31_КОРП/src/Enums/ТипыПоказателейРасчетаЗарплаты/ТипыПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоказателейРасчетаЗарплаты</name>
  <enumValues>
    <name>Денежный</name>
  </enumValues>
  <enumValues>
    <name>Числовой</name>
  </enumValues>
  <enumValues>
    <name>ЧисловойЗависящийОтДругогоПоказателя</name>
  </enumValues>
  <enumValues>
    <name>ЧисловойЗависящийОтСтажа</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/НазначенияПоказателейРасчетаЗарплаты/НазначенияПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияПоказателейРасчетаЗарплаты</name>
  <enumValues>
    <name>ДляСотрудника</name>
  </enumValues>
  <enumValues>
    <name>ДляПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ДляОрганизации</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ТипыПоказателейРасчетаЗарплаты/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный);
	ДанныеВыбора.Добавить(Перечисления.ТипыПоказателейРасчетаЗарплаты.Числовой);
	ДанныеВыбора.Добавить(Перечисления.ТипыПоказателейРасчетаЗарплаты.ЧисловойЗависящийОтДругогоПоказателя);
	
	Если Параметры.Свойство("НазначениеПоказателя") 
		И Параметры.НазначениеПоказателя = Перечисления.НазначенияПоказателейРасчетаЗарплаты.ДляСотрудника Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыПоказателейРасчетаЗарплаты.ЧисловойЗависящийОтСтажа);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
